billing_cf/Enums/энргСостояниеПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

billing_cf/CommonModules/бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Данные строки показаний.
//
// Возвращаемое значение:
//	Структура
//
Функция  ДанныеСтрокиПоказаний() Экспорт 	
	ДанныеСтроки  = Новый Структура;
	ДанныеСтроки.Вставить("ПредыдущиеПоказания");
	ДанныеСтроки.Вставить("ДатаПоследнихПоказаний");
	ДанныеСтроки.Вставить("СостояниеПоказаний");
	ДанныеСтроки.Вставить("ТекущиеПоказания");
	ДанныеСтроки.Вставить("СреднийОбъемПотребления");
	ДанныеСтроки.Вставить("МаксимальноВозможныеПоказания");
	ДанныеСтроки.Вставить("МаксимальноВозможныйОбъемПотребления"); 
	ДанныеСтроки.Вставить("КоэффициентПУ"); 
	ДанныеСтроки.Вставить("Разница");
	ДанныеСтроки.Вставить("Переворот");
	ДанныеСтроки.Вставить("СостояниеПоказаний");
	ДанныеСтроки.Вставить("ПереворотИзмененПользователем");
	ДанныеСтроки.Вставить("СтатусИзмененПользователем");
	ДанныеСтроки.Вставить("ПричинаОтклонения");
	ДанныеСтроки.Вставить("ДопустимыйОбъемОтклонений", 0);
	ДанныеСтроки.Вставить("РасходЗаПредМесяц", 0);
	ДанныеСтроки.Вставить("РасходЗаАналогичныйПериодПредГода", 0);
	
	
	Возврат ДанныеСтроки;   	
КонецФункции

// Процедура - Пересчитать строку приборов учета 
// Перезаполняет данные строки с показаниями (разницу, переворот, СостояниеПоказаний и тд)
//
// Параметры:
//  ТекСтрока		 - ДанныеФормыСтруктура, 
//  ПериодНачисления - Дата
//  КонтрольныйСъем	 - Булево
//
Процедура ПересчитатьСтрокуПриборовУчета(ТекСтрока, ПериодНачисления, КонтрольныйСъем = ложь) Экспорт 
	ПоказанияЗа 						= ?(НачалоМесяца(ТекСтрока.ДатаПоследнихПоказаний) - ПериодНачисления = 0 ,1,1 + Цел((ПериодНачисления - ТекСтрока.ДатаПоследнихПоказаний) / (30*86400)));		
	МаксимальныеВозможныеПоказания 		= ТекСтрока.МаксимальноВозможныеПоказания;			
	Расход 								= ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
	РасходСПереворотом 					= ТекСтрока.МаксимальноВозможныеПоказания - ТекСтрока.ПредыдущиеПоказания + ТекСтрока.ТекущиеПоказания;
	РасходПоМодулю 						= ?(ТекСтрока.ТекущиеПоказания>ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ПредыдущиеПоказания -ТекСтрока.ТекущиеПоказания);	
	
	Если ТекСтрока.СтатусИзмененПользователем  тогда
		Если ТекСтрока.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты") тогда
			ТекСтрока.Разница 			= ?(ТекСтрока.переворот,РасходСПереворотом,Расход);			
		иначе
			ТекСтрока.Разница 			= ?(ТекСтрока.переворот,РасходСПереворотом,Расход);			
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.ПереворотИзмененПользователем  тогда
		Если ТекСтрока.Переворот тогда
			 ТекСтрока.Разница 			= РасходСПереворотом;
			  Возврат;
		 КонецЕсли;
	КонецЕсли;
	
	Если ТекСтрока.ПредыдущиеПоказания < 0 тогда
		ТекСтрока.ПредыдущиеПоказания = 0;
	КонецЕсли;
		
	Если ТекСтрока.ПредыдущиеПоказания = 0 тогда
		ПорядокНачальных 				= 1;
	иначе
		ПорядокНачальных 				= СтрДлина(Строка(Цел(ТекСтрока.ПредыдущиеПоказания))) - 1;
	КонецЕсли;
	
	Если ТекСтрока.ТекущиеПоказания = 0 тогда
		ПорядокКонечных 				= 1;
	иначе
		ПорядокКонечных 				= СтрДлина(Строка(Цел(ТекСтрока.ТекущиеПоказания))) - 1;
	КонецЕсли;	 
	
	Если Расход < 0  и ПорядокНачальных = ПорядокКонечных тогда
		 ТекСтрока.Разница 				= Расход;
		 ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		 ТекСтрока.ПричинаОтклонения	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ОтрицательныйРасход");
		 Возврат;
	КонецЕсли; 
	
	Если ТекСтрока.СреднийОбъемПотребления > 0 и Расход > 0 и Расход > ТекСтрока.СреднийОбъемПотребления Тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.РасходПревышаетМаксимальноДопустимыйОбъем");
		Возврат;
	КонецЕсли;
	
	// определяем расход
	ОпределитьРасход(ТекСтрока, КонтрольныйСъем, Расход, РасходПоМодулю);
	ПроверитьДопустимыйОбъемОтклонений(ТекСтрока);
	
КонецПроцедуры

// Процедура - Провести анализа полученного расхода
// Вызывается с формы документа бестРегистрацияПоказанийНПОбщий. Устаревшая
//
// Параметры:
//  ТекСтрока	 - ДанныеФормыСтруктура 
//
Процедура ПровестиАнализаПолученногоРасхода(ТекСтрока) Экспорт
	
	Если ТекСтрока.РасходЗаПредМесяц <> 0 Тогда
		ТекСтрока.ПроцентОтклоненияОтПредМесяца = (ТекСтрока.Разница - ТекСтрока.РасходЗаПредМесяц)/ТекСтрока.РасходЗаПредМесяц * 100;
	Иначе
		ТекСтрока.ПроцентОтклоненияОтПредМесяца = 0;
	КонецЕсли;
	
	Если ТекСтрока.РасходЗаАналогичныйПериодПредГода <> 0 Тогда
		ТекСтрока.ПроцентОтклоненияОтАналогичногоПериодаПредГода = (ТекСтрока.Разница - ТекСтрока.РасходЗаАналогичныйПериодПредГода)/ТекСтрока.РасходЗаАналогичныйПериодПредГода * 100;
	Иначе
		ТекСтрока.ПроцентОтклоненияОтАналогичногоПериодаПредГода = 0;
	КонецЕсли;
	
	Если ТекСтрока.СреднийРасход <> 0 Тогда
		ТекСтрока.ПроцентОтклоненияОтСреднегоРасхода = (ТекСтрока.Разница - ТекСтрока.СреднийРасход)/ТекСтрока.СреднийРасход * 100;
	Иначе
		ТекСтрока.ПроцентОтклоненияОтСреднегоРасхода = 0;
	КонецЕсли;
	
КонецПроцедуры

#Область ВспомогательныеПроцедурыФункции

Процедура ОпределитьРасход(ТекСтрока, КонтрольныйСъем, Расход, РасходПоМодулю)
	
	Если ТекСтрока.ТекущиеПоказания = 0 тогда
		ТекСтрока.Разница 				= 0;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
		ТекСтрока.ПричинаОтклонения		= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");
	ИначеЕсли КонтрольныйСъем и  Расход >=  0 тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
		ТекСтрока.ПричинаОтклонения		= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");
	ИначеЕсли КонтрольныйСъем  тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= Ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");	
	ИначеЕсли Расход >= 0 тогда	
		 ТекСтрока.Разница 				= Расход;
		 ТекСтрока.Переворот 			= ложь;
		 ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
		 ТекСтрока.ПричинаОтклонения	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");
	иначе
		ТекСтрока.Разница 				= -РасходПоМодулю;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ОтрицательныйРасход");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДопустимыйОбъемОтклонений(ТекСтрока)
	
	Если ТекСтрока.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда 
		Возврат;
	КонецЕсли;
	            	
	ЕстьРеквизит = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекСтрока, "ДопустимыйОбъемОтклонений");  	
	Если ЕстьРеквизит И ТекСтрока.ДопустимыйОбъемОтклонений > 0 Тогда
		
		РазницаСхожихПериодов = 0;
		
		Если ТекСтрока.РасходЗаАналогичныйПериодПредГода > 0 Тогда 
			РазницаСхожихПериодов = ?(
				ТекСтрока.Разница > ТекСтрока.РасходЗаАналогичныйПериодПредГода,
					ТекСтрока.Разница - ТекСтрока.РасходЗаАналогичныйПериодПредГода,
					ТекСтрока.РасходЗаАналогичныйПериодПредГода - ТекСтрока.Разница);
			
		ИначеЕсли ТекСтрока.РасходЗаПредМесяц > 0 Тогда
			РазницаСхожихПериодов = ?(
				ТекСтрока.Разница > ТекСтрока.РасходЗаПредМесяц,
					ТекСтрока.Разница - ТекСтрока.РасходЗаПредМесяц,
					ТекСтрока.РасходЗаПредМесяц - ТекСтрока.Разница);
		КонецЕсли;
		
		Если РазницаСхожихПериодов > ТекСтрока.ДопустимыйОбъемОтклонений Тогда
			
			ТекСтрока.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
			ТекСтрока.ПричинаОтклонения	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.СомнительныеПоказания"); 		
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти
